app/views/employees/_form.html.erb

SELECT 1 AS one FROM "employees" WHERE "employees"."company_id" = ? LIMIT ?  [["company_id", 1], ["LIMIT", 1]]
---

    <% if @company.employees.empty? %>