app/controllers/companys_controller.rb

    def create
        @new_company = Company.new(company_params)
        if @new_company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Millard Woodworking"], ["created_at", "2020-08-02 18:08:07.409636"], ["updated_at", "2020-08-02 18:08:07.409636"]]