app/controllers/employees_controller.rb

    def new
        @employee = Employee.new
        @company = Company.find(params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @employee = Employee.new(employee_params)
        @company = Company.find(params[:company_id]) if params[:company_id]
        if @employee.save
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "employees" ("first_name", "last_name", "title", "lead", "email", "password_digest", "created_at", "updated_at", "company_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def current_company_employees
        Employee.all.select {|emp| emp.company_id == session[:company_id]}
---
SELECT "employees".* FROM "employees"