app/controllers/sessions_controller.rb

    def create
        @employee = Employee.find_by(email: params[:employee][:email])
---
SELECT "employees".* FROM "employees" WHERE "employees"."email" = ? LIMIT ?  [["email", "millardjimmy@gmail.com"], ["LIMIT", 1]]